[
{   
    "id": 1,
    "chefName": "John Smith",
    "experienceYears": 10,
    "recipeCount": 50,
    "likes": 5000,
    "shortDescription": "Jane Smith is an award-winning chef who has been specializing in Italian cuisine for the past 15 years. She has worked at several top restaurants in Italy and the United States, and has gained a reputation for her exceptional dishes that showcase the flavors and traditions of Italy. Jane is particularly skilled at making handmade pasta, and is known for her classic spaghetti carbonara and lasagna recipes. Her passion for Italian cuisine shines through in her cooking, and she is committed to using only the freshest, highest-quality ingredients in all of her dishes. With 50 recipes under her belt and 10,000 likes from her loyal followers, Jane continues to inspire and delight food lovers around the world.",
    "pictureUrl": "https://i.ibb.co/wNJg0KD/chef-1.jpg",
    "recipes": [
      {
        "recipeName": "Spaghetti Carbonara",
        "recipePictureUrl": "https://i.ibb.co/TYxvXcp/1.jpg",
        "description": "A classic Italian dish made with spaghetti, bacon, eggs, and Parmesan cheese.",
        "rating": 4.5,
        "ingredients": [
            "This classic spaghetti carbonara recipe is quick and easy to make and always satisfies. To start, you'll need 1 pound of spaghetti, which you'll cook in a large pot of salted boiling water until al dente. While the spaghetti cooks, you'll fry up 8 ounces of chopped bacon until crispy and set aside. In a separate bowl, you'll whisk together 4 large eggs and 1 cup of grated Parmesan cheese until well combined. Once the spaghetti is cooked, you'll drain it and immediately toss it with the bacon and egg mixture until the eggs are cooked and the spaghetti is coated in a creamy sauce. Season with salt and black pepper to taste and serve hot. This dish is perfect for a quick and delicious weeknight dinner!"
        ]
      },
      {
        "recipeName": "Beef Bourguignon",
        "recipePictureUrl": "https://i.ibb.co/sJMJncj/2.jpg",
        "description": "A hearty French stew made with beef, red wine, vegetables, and herbs.",
        "rating": 4.8,
        "ingredients": [
         "I made this dish recently and it turned out absolutely delicious. For the base of the recipe, I used 2 pounds of beef chuck, which I cut into cubes to provide a meaty texture and flavor. I added in a bottle of red wine to add complexity and depth to the stew. To round out the flavors, I chopped up 4 carrots, 1 onion, and minced 3 garlic cloves. I also mixed in 3 tablespoons of tomato paste, 2 tablespoons of flour, and 1 tablespoon of thyme to thicken the stew and add some herbaceous notes. Finally, I added in a bay leaf and seasoned with salt and black pepper to taste. The result was a hearty and flavorful beef stew that I thoroughly enjoyed, and I'm sure you will too!"
        ]
      },
      {
        "recipeName": "Chocolate Cake",
        "recipePictureUrl": "https://i.ibb.co/XJdbPTH/3.jpg",
        "description": "A decadent dessert made with cocoa powder, sugar, eggs, and butter.",
        "rating": 4.9,
        "ingredients": [
          "So, for this recipe, you will need 2 cups of all-purpose flour, 3/4 cup of unsweetened cocoa powder, 2 cups of granulated sugar, 2 teaspoons of baking soda, 1 teaspoon of baking powder, and 1 teaspoon of salt. In a separate bowl, you'll mix together 1 cup of buttermilk, 1/2 cup of vegetable oil, 2 large eggs, and 2 teaspoons of vanilla extract. Then, you'll add the dry ingredients to the wet ingredients and mix until combined. Finally, you'll stir in 1 cup of boiling water to the batter to create a smooth consistency. This recipe makes a delicious chocolate cake that is sure to be a crowd-pleaser!"
        ]
      }
    ]
  },
  {
    "id": 2,
    "chefName": "Maria Rodriguez",
    "experienceYears": 15,
    "recipeCount": 100,
    "likes": 10000,
    "shortDescription": "Jane Smith is an award-winning chef who has been specializing in Italian cuisine for the past 15 years. She has worked at several top restaurants in Italy and the United States, and has gained a reputation for her exceptional dishes that showcase the flavors and traditions of Italy. Jane is particularly skilled at making handmade pasta, and is known for her classic spaghetti carbonara and lasagna recipes. Her passion for Italian cuisine shines through in her cooking, and she is committed to using only the freshest, highest-quality ingredients in all of her dishes. With 50 recipes under her belt and 10,000 likes from her loyal followers, Jane continues to inspire and delight food lovers around the world.",
    "pictureUrl": "https://i.ibb.co/c2QtHyd/chef-3.jpg",
    "recipes": [
      {
        "recipeName": "Taco Salad",
        "recipePictureUrl": "https://i.ibb.co/k5HgVbn/4.jpg",
        "description": "A refreshing and satisfying salad made with ground beef, lettuce, tomatoes, cheese, and tortilla chips.",
        "rating": 4.7,
        "ingredients": [
        "This hearty and satisfying taco salad is a crowd-pleaser and perfect for a quick and easy weeknight dinner. To start, brown 1 pound of ground beef in a skillet over medium-high heat until fully cooked, then drain off any excess fat. In a large bowl, mix together 1 head of chopped iceberg lettuce, 2 diced tomatoes, 1 cup of shredded cheddar cheese, 1/2 cup of diced onion, and 1/2 cup of crushed tortilla chips. Add the cooked ground beef to the bowl and toss all of the ingredients together until well combined. In a separate bowl, mix together 1/2 cup of salsa and 1/2 cup of sour cream to create a delicious dressing for the salad. Drizzle the dressing over the salad, season with salt and black pepper to taste, and serve immediately. This taco salad is sure to be a hit with your family and friends!"
        ]
      },
      {
        "recipeName": "Beef Stir-Fry",
        "recipePictureUrl": "https://i.ibb.co/dM9gRyR/6.jpg",
        "description": "A quick and easy stir-fry made with beef, vegetables, and a flavorful sauce.",
        "rating": 4.5,
        "ingredients": [
          "This savory and flavorful beef stir-fry recipe is perfect for a quick and delicious weeknight meal. Start by slicing 1 pound of flank steak into thin strips and setting it aside. Then, in a large skillet or wok over high heat, sauté 1 sliced red bell pepper, 1 sliced green bell pepper, 1 sliced onion, and 2 minced garlic cloves until they are crisp-tender. In a separate bowl, whisk together 1 tablespoon of cornstarch, 1/4 cup of soy sauce, 1/4 cup of beef broth, 1 tablespoon of honey, 1 teaspoon of sesame oil, and 1/4 teaspoon of red pepper flakes until well combined. Set the sauce aside. Once the vegetables are cooked, remove them from the skillet and set aside. Add the sliced flank steak to the same skillet and cook until browned on all sides. Once the beef is fully cooked, add the vegetables back to the skillet, pour the sauce over everything, and toss until the sauce is evenly distributed. Serve hot over rice or noodles and enjoy!"
        ]
      },
      {
        "recipeName": "Banana Bread",
        "recipePictureUrl": "https://i.ibb.co/wrSQN95/5.jpg",
        "description": "A moist and flavorful bread made with ripe bananas, sugar, flour, and a few other pantry staples.",
        "rating": 4.9,
        "ingredients": [
         "This classic banana bread recipe is easy to make and always a crowd-pleaser. To start, preheat your oven to 350°F and grease a 9x5 inch loaf pan. In a large mixing bowl, combine 3 mashed ripe bananas, 1/2 cup of melted unsalted butter, and 1 cup of granulated sugar. Mix in 1 beaten egg and 1 teaspoon of vanilla extract. In a separate bowl, whisk together 1 teaspoon of baking soda, a pinch of salt, and 1 1/2 cups of all-purpose flour. Gradually stir the dry ingredients into the wet mixture until just combined. Do not overmix. Pour the batter into the greased loaf pan and bake for 50-60 minutes, or until a toothpick inserted into the center of the bread comes out clean. Let the bread cool in the pan for 10-15 minutes before removing it and placing it on a wire rack to cool completely. Slice and serve the banana bread warm with a pat of butter or cream cheese, or store it in an airtight container for later."
        ]
      }
    ]
  },
  {
    "id": 3,
    "chefName": "Juan Perez",
    "experienceYears": 20,
    "recipeCount": 200,
    "likes": 15000,
    "shortDescription": "Jane Smith is an award-winning chef who has been specializing in Italian cuisine for the past 15 years. She has worked at several top restaurants in Italy and the United States, and has gained a reputation for her exceptional dishes that showcase the flavors and traditions of Italy. Jane is particularly skilled at making handmade pasta, and is known for her classic spaghetti carbonara and lasagna recipes. Her passion for Italian cuisine shines through in her cooking, and she is committed to using only the freshest, highest-quality ingredients in all of her dishes. With 50 recipes under her belt and 10,000 likes from her loyal followers, Jane continues to inspire and delight food lovers around the world.",
    "pictureUrl": "https://i.ibb.co/ZXQCPs2/chef-2.jpg",
    "recipes": [
      {
        "recipeName": "Grilled Steak",
        "recipePictureUrl": "https://i.ibb.co/TYxvXcp/1.jpg",
        "description": "A delicious and easy grilled steak recipe with a simple garlic and herb marinade.",
        "rating": 4.8,
        "ingredients": [
        "This mouth-watering flank steak recipe is perfect for a summer barbecue or a hearty weeknight dinner. Start by prepping the marinade. In a bowl, mix together 1/4 cup of olive oil, 2 tablespoons of balsamic vinegar, 2 tablespoons of Worcestershire sauce, 1 tablespoon of Dijon mustard, 3 minced cloves of garlic, 2 tablespoons of chopped fresh parsley, and 1 tablespoon of chopped fresh thyme. Add salt and pepper to taste. Pour the marinade into a large resealable plastic bag and add 2 pounds of flank steak to the bag. Seal the bag and turn it to coat the steak in the marinade. Marinate in the fridge for at least 30 minutes, or up to 8 hours for more flavor. Once marinated, remove the steak from the bag and discard the marinade. Heat your grill to medium-high heat and grill the steak for 5-6 minutes per side, or until cooked to your desired level of doneness. Let the steak rest for a few minutes before slicing against the grain and serving. Enjoy with your favorite sides and a refreshing drink!"
        ]
      },
      {
        "recipeName": "Shrimp Scampi",
        "recipePictureUrl": "https://i.ibb.co/sJMJncj/2.jpg",
        "description": "A classic shrimp scampi recipe with garlic, lemon, white wine, and butter. Perfect over pasta!",
        "rating": 4.7,
        "ingredients": [
       "This delicious linguine and shrimp recipe is perfect for a quick and easy weeknight dinner. Start by cooking 8 ounces of linguine according to the package instructions. In a large skillet, melt 1/4 cup of unsalted butter over medium heat. Add 4 minced cloves of garlic and cook until fragrant, about 1-2 minutes. Add 1/2 cup of white wine, 1/4 cup of fresh lemon juice, 1/4 teaspoon of red pepper flakes, and salt and pepper to taste. Bring the sauce to a simmer and let it cook for 2-3 minutes until slightly reduced. Add 1 pound of large shrimp, peeled and deveined, to the skillet and cook until the shrimp are pink and cooked through, about 3-4 minutes. Stir in 1/4 cup of chopped fresh parsley. Serve the shrimp and sauce over the cooked linguine and enjoy!"
        ]
      },
      {
        "recipeName": "Chocolate Cake",
        "recipePictureUrl": "https://i.ibb.co/XJdbPTH/3.jpg",
        "description": "A rich and decadent chocolate cake recipe with a chocolate ganache frosting.",
        "rating": 4.9,
        "ingredients": [
         "This recipe makes a rich and decadent chocolate cake that is perfect for any occasion. Start by preheating your oven to 350°F and greasing two 9-inch round cake pans. In a large mixing bowl, combine 1 3/4 cups of all-purpose flour, 2 cups of granulated sugar, 3/4 cup of unsweetened cocoa powder, 2 teaspoons of baking soda, 1 teaspoon of baking powder, and 1 teaspoon of salt. Mix well to combine. Add in 1 cup of buttermilk, 1/2 cup of vegetable oil, 2 large eggs, and 2 teaspoons of vanilla extract. Mix until well combined. Stir in 1 cup of boiling water, which will make the batter thin. Pour the batter into the prepared cake pans and bake for 30-35 minutes, or until a toothpick inserted in the center comes out clean. Let the cakes cool completely before frosting. For the frosting, melt 8 ounces of chopped semisweet chocolate in a heatproof bowl over a pot of simmering water. Once melted, remove from heat and stir in 1/2 cup of heavy cream until well combined. Allow the frosting to cool and thicken for a few minutes before spreading it over the cooled cakes. Serve and enjoy!"
        ]
      }
    ]
  },
  {
    "id": 4,
    "chefName": "Harry James",
    "experienceYears": 12,
    "recipeCount": 85,
    "likes": 8000,
    "shortDescription": "Jane Smith is an award-winning chef who has been specializing in Italian cuisine for the past 15 years. She has worked at several top restaurants in Italy and the United States, and has gained a reputation for her exceptional dishes that showcase the flavors and traditions of Italy. Jane is particularly skilled at making handmade pasta, and is known for her classic spaghetti carbonara and lasagna recipes. Her passion for Italian cuisine shines through in her cooking, and she is committed to using only the freshest, highest-quality ingredients in all of her dishes. With 50 recipes under her belt and 10,000 likes from her loyal followers, Jane continues to inspire and delight food lovers around the world.",
    "pictureUrl": "https://i.ibb.co/56Zt169/chef-4.jpg",
    "recipes": [
      {
        "recipeName": "Pesto Pasta",
        "recipePictureUrl": "https://i.ibb.co/k5HgVbn/4.jpg",
        "description": "A delicious and easy pasta dish with homemade pesto sauce, cherry tomatoes, and parmesan cheese.",
        "rating": 4.5,
        "ingredients": [
        "This recipe is for a classic and delicious pasta dish called linguine with pesto. It is believed to have originated in the Liguria region of Italy. To make the pesto sauce, you will need 2 cups of fresh basil leaves, 1/2 cup of grated parmesan cheese, 1/2 cup of pine nuts, 3 cloves of minced garlic, and 1/2 cup of olive oil. In addition to the pesto, you will also need 1 pound of linguine pasta, 1 pint of cherry tomatoes (halved), and salt and pepper to taste. Start by making the pesto sauce in a food processor or blender by blending together the basil leaves, parmesan cheese, pine nuts, garlic, and olive oil until smooth. Cook the linguine according to package instructions, and then toss it with the pesto sauce and cherry tomatoes. Season with salt and pepper to taste, and serve immediately. Enjoy!"
        ]
      },
      {
        "recipeName": "Taco Salad",
        "recipePictureUrl": "https://i.ibb.co/wrSQN95/5.jpg",
        "description": "A healthy and delicious salad with ground beef, avocado, tomatoes, and corn chips.",
        "rating": 4.2,
        "ingredients": [
       "This recipe is for a delicious taco salad. To make it, you'll need one pound of ground beef and a packet of taco seasoning. Brown the beef in a pan and add the taco seasoning according to package instructions.Next, assemble your salad. Start with a bed of chopped lettuce in a large bowl. Add halved cherry tomatoes, crushed corn chips, diced avocado, and shredded cheddar cheese. Top with the seasoned ground beef.For the finishing touches, sprinkle chopped fresh cilantro over the top and dollop with sour cream. Serve immediately and enjoy!"
        ]
      },
      {
        "recipeName": "Chicken Stir Fry",
        "recipePictureUrl": "https://i.ibb.co/dM9gRyR/6.jpg",
        "description": "A quick and easy stir fry with chicken, vegetables, and a sweet and tangy sauce.",
        "rating": 4.8,
        "ingredients": [
          "This is a recipe for a Chinese-style chicken stir-fry. To make it, you will need 1 pound of boneless, skinless chicken breasts, sliced, along with cornstarch, soy sauce, sesame oil, and vegetable oil. You will also need garlic, ginger, red bell pepper, yellow onion, broccoli florets, hoisin sauce, rice vinegar, and honey to add flavor to the dish. To prepare the stir-fry, you will start by coating the chicken with cornstarch and seasoning it with soy sauce and sesame oil. Then, you will heat up some vegetable oil in a wok or large skillet and stir-fry the chicken until it's cooked through. Next, you'll add garlic, ginger, bell pepper, onion, and broccoli to the pan and stir-fry until they're tender-crisp. Finally, you'll add hoisin sauce, rice vinegar, and honey to the pan and stir-fry until the sauce thickens and coats everything in the pan. The result is a delicious and healthy meal that's perfect for a quick and easy weeknight dinner. The recipe doesn't specify who makes the dish."
        ]
      }
    ]
  },
  {
    "id": 5,
    "chefName": "Joe Goldberg",
    "experienceYears": 20,
    "recipeCount": 120,
    "likes": 10000,
    "shortDescription": "Jane Smith is an award-winning chef who has been specializing in Italian cuisine for the past 15 years. She has worked at several top restaurants in Italy and the United States, and has gained a reputation for her exceptional dishes that showcase the flavors and traditions of Italy. Jane is particularly skilled at making handmade pasta, and is known for her classic spaghetti carbonara and lasagna recipes. Her passion for Italian cuisine shines through in her cooking, and she is committed to using only the freshest, highest-quality ingredients in all of her dishes. With 50 recipes under her belt and 10,000 likes from her loyal followers, Jane continues to inspire and delight food lovers around the world.",
    "pictureUrl": "https://i.ibb.co/jTwxJrr/chef-5.jpg",
    "recipes": [
      {
        "recipeName": "Spaghetti Bolognese",
        "recipePictureUrl": "https://i.ibb.co/TYxvXcp/1.jpg",
        "description": "A classic Italian dish with spaghetti, tomato sauce, and ground beef.",
        "rating": 4.7,
        "ingredients": [
        "This classic spaghetti recipe is a perfect weeknight meal. To make it, heat 2 tbsp. of olive oil in a large pot over medium heat. Add 1 chopped onion and 2 minced garlic cloves and sauté until softened, about 5 minutes. Add 1 lb. of ground beef and cook until browned, breaking it up into small pieces as it cooks. Drain any excess fat. Stir in 1 can of crushed tomatoes, 1 can of tomato paste, and 1 cup of water. Add 1 tsp. each of dried basil and oregano, and season with salt and pepper to taste. Simmer for 20-30 minutes to allow the flavors to meld. Serve over 1 lb. of cooked spaghetti."
        ]
      },
      {
        "recipeName": "Grilled Salmon",
        "recipePictureUrl": "https://i.ibb.co/sJMJncj/2.jpg",
        "description": "A healthy and flavorful dish with grilled salmon, asparagus, and lemon.",
        "rating": 4.9,
        "ingredients": [
         "This recipe features baked salmon with asparagus and lemon. The recipe calls for 5 salmon fillets, 1 lb. of asparagus, 2 sliced lemons, 2 cloves of minced garlic, 2 tbsp. of olive oil, salt, and pepper. To prepare, preheat the oven to 400°F and line a baking sheet with parchment paper. Arrange the salmon fillets and asparagus on the baking sheet and season with salt, pepper, and minced garlic. Drizzle with olive oil and top with lemon slices. Bake for 12-15 minutes or until the salmon is cooked through and the asparagus is tender."
        ]
      },
      {
        "recipeName": "Beef Stir Fried Rice",
        "recipePictureUrl": "https://i.ibb.co/XJdbPTH/3.jpg",
        "description": "A quick and easy stir fry with beef, vegetables, and a savory sauce.",
        "rating": 4.5,
        "ingredients": [
      "This recipe is for beef and vegetable stir-fry. To make this dish, you will need 1 pound of beef sirloin, sliced, which is marinated in a mixture of 1 tablespoon of cornstarch, 1 tablespoon of soy sauce, and 1 tablespoon of sesame oil. The beef is then stir-fried with 2 tablespoons of vegetable oil, 2 cloves of minced garlic, and 1 inch of minced ginger. Add in 1 sliced red bell pepper, 1 sliced yellow onion, and 1 cup of broccoli florets, and stir-fry until the vegetables are tender. In a separate bowl, mix 1/2 cup of beef broth, 2 tablespoons of oyster sauce, and 1 teaspoon of sugar, then add this mixture to the pan and cook until the sauce has thickened. Serve over rice or noodles."
        ]
      }
    ]
  },
  {
    "id": 6,
    "chefName": "Andre Russell",
    "experienceYears": 12,
    "recipeCount": 60,
    "likes": 5000,
    "shortDescription": "Jane Smith is an award-winning chef who has been specializing in Italian cuisine for the past 15 years. She has worked at several top restaurants in Italy and the United States, and has gained a reputation for her exceptional dishes that showcase the flavors and traditions of Italy. Jane is particularly skilled at making handmade pasta, and is known for her classic spaghetti carbonara and lasagna recipes. Her passion for Italian cuisine shines through in her cooking, and she is committed to using only the freshest, highest-quality ingredients in all of her dishes. With 50 recipes under her belt and 10,000 likes from her loyal followers, Jane continues to inspire and delight food lovers around the world.",
    "pictureUrl": "https://i.ibb.co/xhL4Hzk/chef-6.jpg",
    "recipes": [
      {
        "recipeName": "Enchiladas Verdes",
        "recipePictureUrl": "https://i.ibb.co/k5HgVbn/4.jpg",
        "description": "A traditional Mexican dish with chicken, tortillas, and green salsa.",
        "rating": 4.8,
        "ingredients": [
       "To make these chicken enchiladas with salsa verde, start by preheating the oven to 375°F. In a large skillet over medium heat, sauté the onion and garlic in vegetable oil until soft, then add in the shredded chicken and stir to combine. Set aside. In a blender or food processor, blend together the tomatillos, serrano peppers, cilantro, chicken broth, and salt and pepper until smooth. Pour the salsa verde into a saucepan and simmer over medium heat for 10-15 minutes. To assemble the enchiladas, dip each corn tortilla in the warm salsa verde and fill with a spoonful of the chicken mixture. Roll the tortilla and place it seam-side down in a 9x13 inch baking dish. Repeat with the remaining tortillas and chicken mixture. Pour the remaining salsa verde over the enchiladas and sprinkle with shredded cheese. Bake in the oven for 20-25 minutes or until the cheese is melted and bubbly. Serve hot with your favorite toppings such as sour cream, avocado, or chopped cilantro."
        ]
      },
      {
        "recipeName": "Beef Stroganoff",
        "recipePictureUrl": "https://i.ibb.co/wrSQN95/5.jpg",
        "description": "A hearty Russian dish with beef, mushrooms, and sour cream sauce.",
        " ": 4.5,
        "ingredients": [
          "This recipe is for beef stroganoff. To make this dish, you'll need one pound of beef sirloin, sliced into thin strips, which you'll sauté in a pan with vegetable oil until browned. Remove the beef from the pan and set aside. Add sliced mushrooms, chopped onion, and minced garlic to the same pan and sauté until the onions are translucent and the mushrooms are browned. Sprinkle two tablespoons of flour over the vegetables and stir to combine. Gradually add one cup of beef broth to the pan, stirring constantly to prevent lumps from forming. Add the beef back to the pan and let the mixture simmer for a few minutes until the sauce thickens. Stir in 1/2 cup of sour cream and season with salt and pepper to taste. Serve over cooked egg noodles."
        ]
      },
      {
        "recipeName": "Pesto Pasta",
        "recipePictureUrl": "https://i.ibb.co/dM9gRyR/6.jpg",
        "description": "A simple and delicious Italian dish with pasta and basil pesto.",
        "rating": 4.7,
        "ingredients": [
     "This recipe is for a classic pesto sauce pasta dish. Start by cooking 1 pound of linguine in boiling salted water until al dente. In a food processor, blend 1 cup of fresh basil leaves, 1/2 cup of grated Parmesan cheese, 1/2 cup of olive oil, 1/3 cup of pine nuts, and 3 cloves of minced garlic until a smooth paste forms. Season with salt and pepper to taste. Drain the cooked pasta and return it to the pot. Add the pesto sauce and toss well to combine. Serve hot, garnished with additional Parmesan cheese and fresh basil leaves if desired."
        ]
      }
    ]
  }
  
]
  
